#+OPTIONS: toc:nil author:nil creator:nil
#+LaTeX_HEADER: \author{J\"org D\"opfert}
#+LaTeX_CLASS_OPTIONS: [11pt]
#+LaTeX_HEADER: \usepackage[a4paper, total={150mm,237mm}, left=30mm, top=20mm]{geometry}
 #+LaTeX_HEADER: \usepackage{caption} 

#+BEGIN_LaTeX
\captionsetup[table]{skip=8pt}
#+END_LaTeX
 

#+TITLE: Planning (Lesson 11): Heuristic Analysis



I begin this report with an evaluation of the results of the different search
methods. Optimal plans can be found in Section [[Optimal plans]], and detailed
metrics for all problems in consideration are displayed in Table [[tab:tab1]].

** Problem 1

#+begin_src python :exports results :noweb strip-export
<<preamble>>
filename='data/non_heuristic_report.h5'
df = pd.read_hdf(filename)
df = df.sort_values(['Problem'])
df = df[df['Search Method'] == 'breadth_first_search']
df.Actions = df.Actions.apply(lambda x: "\n".join(x))
return df.Actions.iloc[0]
#+end_src

#+RESULTS:
: Load(C2, P2, JFK)
: Load(C1, P1, SFO)
: Fly(P2, JFK, SFO)
: Unload(C2, P2, SFO)
: Fly(P1, SFO, JFK)
: Unload(C1, P1, JFK)

** Problem 2

#+begin_src python :exports results :noweb strip-export
<<preamble>>
filename='data/non_heuristic_report.h5'
df = pd.read_hdf(filename)
df = df.sort_values(['Problem'])
df = df[df['Search Method'] == 'breadth_first_search']
df.Actions = df.Actions.apply(lambda x: "\n".join(x))
return df.Actions.iloc[1]
#+end_src

#+RESULTS:
: Load(C2, P2, JFK)
: Load(C1, P1, SFO)
: Load(C3, P3, ATL)
: Fly(P2, JFK, SFO)
: Unload(C2, P2, SFO)
: Fly(P1, SFO, JFK)
: Unload(C1, P1, JFK)
: Fly(P3, ATL, SFO)
: Unload(C3, P3, SFO)

** Problem 3

#+begin_src python :exports results :noweb strip-export
<<preamble>>
filename='data/non_heuristic_report.h5'
df = pd.read_hdf(filename)
df = df.sort_values(['Problem'])
df = df[df['Search Method'] == 'breadth_first_search']
df.Actions = df.Actions.apply(lambda x: "\n".join(x))
return df.Actions.iloc[2]
#+end_src

#+RESULTS:
#+begin_example
Load(C2, P2, JFK)
Load(C1, P1, SFO)
Fly(P2, JFK, ORD)
Load(C4, P2, ORD)
Fly(P1, SFO, ATL)
Load(C3, P1, ATL)
Fly(P1, ATL, JFK)
Unload(C1, P1, JFK)
Unload(C3, P1, JFK)
Fly(P2, ORD, SFO)
Unload(C2, P2, SFO)
Unload(C4, P2, SFO)
#+end_example



